# <font color="DE1509">Introduction to Pandas Library (part 2)</span>

In [40]:
import numpy as np
import pandas as pd

#titanic_data = pd.read_csv("titanic.csv")
titanic_data = pd.read_csv("https://raw.githubusercontent.com/ThammakornS/ProgStat/main/dataset/titanic.csv")
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

&nbsp;  
#### <font color="127C02">*loc & iloc*</span>

When it comes to select data on a DataFrame, Pandas *loc* and *iloc* are two top favorites.

*loc* is label-based, which means that you have to specify rows and columns based on their row and column labels.  
*iloc* is integer position-based, so you have to specify rows and columns by their integer indices.

In [41]:
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [42]:
age = titanic_data.loc[1, 'Age']  #get age of row index 1
print(age)
type(age)

38.0

numpy.float64

In [43]:
age = titanic_data.iloc[1, 5]  #get age (column index 5) of row index 1
print(age)
type(age)

38.0

numpy.float64

In [44]:
ages = titanic_data.loc[:, 'Age']  #get age values from all rows
print(ages)
type(ages)  #note that the type is series not dataframe

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

pandas.core.series.Series

In [45]:
ages = titanic_data.iloc[:, 5]  #get age values from all rows
print(ages)
type(ages)  #note that the type is series not dataframe

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

pandas.core.series.Series

In [46]:
sub = titanic_data.loc[:, ['Pclass', 'Age']]
display(sub)
type(sub)  #type is dataframe

     Pclass   Age
0         3  22.0
1         1  38.0
2         3  26.0
3         1  35.0
4         3  35.0
..      ...   ...
886       2  27.0
887       1  19.0
888       3   NaN
889       1  26.0
890       3  32.0

[891 rows x 2 columns]

pandas.core.frame.DataFrame

In [ ]:
sub = titanic_data.loc[0:11, 'Pclass':'Age'] #ตั้งแต่ Colum Pclass to age 
display(sub)
type(sub)

    Pclass                                               Name     Sex   Age
0        3                            Braund, Mr. Owen Harris    male  22.0
1        1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2        3                             Heikkinen, Miss. Laina  female  26.0
3        1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4        3                           Allen, Mr. William Henry    male  35.0
5        3                                   Moran, Mr. James    male   NaN
6        1                            McCarthy, Mr. Timothy J    male  54.0
7        3                     Palsson, Master. Gosta Leonard    male   2.0
8        3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
9        2                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0
10       3                    Sandstrom, Miss. Marguerite Rut  female   4.0
11       1                           Bonnell, Miss. Elizabeth  female  58.0

pandas.core.frame.DataFrame

In [ ]:
sub = titanic_data.iloc[0:11, 2:6] #Number สามารถเลือก Colum ได้เหมือนกัน
display(sub)
type(sub)

    Pclass                                               Name     Sex   Age
0        3                            Braund, Mr. Owen Harris    male  22.0
1        1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2        3                             Heikkinen, Miss. Laina  female  26.0
3        1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4        3                           Allen, Mr. William Henry    male  35.0
5        3                                   Moran, Mr. James    male   NaN
6        1                            McCarthy, Mr. Timothy J    male  54.0
7        3                     Palsson, Master. Gosta Leonard    male   2.0
8        3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
9        2                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0
10       3                    Sandstrom, Miss. Marguerite Rut  female   4.0

pandas.core.frame.DataFrame

In [49]:
sub = titanic_data.iloc[:, [2, 5]]
display(sub)
type(sub)  #type is dataframe

     Pclass   Age
0         3  22.0
1         1  38.0
2         3  26.0
3         1  35.0
4         3  35.0
..      ...   ...
886       2  27.0
887       1  19.0
888       3   NaN
889       1  26.0
890       3  32.0

[891 rows x 2 columns]

pandas.core.frame.DataFrame

In [50]:
titanic_data.filter(['Pclass','Age'])

     Pclass   Age
0         3  22.0
1         1  38.0
2         3  26.0
3         1  35.0
4         3  35.0
..      ...   ...
886       2  27.0
887       1  19.0
888       3   NaN
889       1  26.0
890       3  32.0

[891 rows x 2 columns]

In [51]:
sub = titanic_data.iloc[0:11, 2:6]
display(sub)
type(sub)

    Pclass                                               Name     Sex   Age
0        3                            Braund, Mr. Owen Harris    male  22.0
1        1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2        3                             Heikkinen, Miss. Laina  female  26.0
3        1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4        3                           Allen, Mr. William Henry    male  35.0
5        3                                   Moran, Mr. James    male   NaN
6        1                            McCarthy, Mr. Timothy J    male  54.0
7        3                     Palsson, Master. Gosta Leonard    male   2.0
8        3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
9        2                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0
10       3                    Sandstrom, Miss. Marguerite Rut  female   4.0

pandas.core.frame.DataFrame

\
***loc* with conditions**

In [52]:
titanic_data.loc[titanic_data.Age > 70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [ ]:
titanic_data.loc[titanic_data.Age > 70,['Pclass','Survived','Age']] #Boolear

     Pclass  Survived   Age
96        1         0  71.0
116       3         0  70.5
493       1         0  71.0
630       1         1  80.0
851       3         0  74.0

In [54]:
titanic_data.iloc[0:23, [2,3,6]]

    Pclass                                               Name  SibSp
0        3                            Braund, Mr. Owen Harris      1
1        1  Cumings, Mrs. John Bradley (Florence Briggs Th...      1
2        3                             Heikkinen, Miss. Laina      0
3        1       Futrelle, Mrs. Jacques Heath (Lily May Peel)      1
4        3                           Allen, Mr. William Henry      0
5        3                                   Moran, Mr. James      0
6        1                            McCarthy, Mr. Timothy J      0
7        3                     Palsson, Master. Gosta Leonard      3
8        3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)      0
9        2                Nasser, Mrs. Nicholas (Adele Achem)      1
10       3                    Sandstrom, Miss. Marguerite Rut      1
11       1                           Bonnell, Miss. Elizabeth      0
12       3                     Saundercock, Mr. William Henry      0
13       3                        Andersson, Mr. Anders Johan      1
14       3               Vestrom, Miss. Hulda Amanda Adolfina      0
15       2                   Hewlett, Mrs. (Mary D Kingcome)       0
16       3                               Rice, Master. Eugene      4
17       2                       Williams, Mr. Charles Eugene      0
18       3  Vander Planke, Mrs. Julius (Emelia Maria Vande...      1
19       3                            Masselmani, Mrs. Fatima      0
20       2                               Fynney, Mr. Joseph J      0
21       2                              Beesley, Mr. Lawrence      0
22       3                        McGowan, Miss. Anna "Annie"      0

In [55]:
titanic_data.loc[(titanic_data.Age > 70) & (titanic_data.Pclass == 1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S

\
The A:B used in loc and iloc may have different meaning.  
For *loc*, A and B are included.  
For *iloc*, A is included, B is __excluded__.

In [ ]:
sub = titanic_data.loc[1:3, :]  #rows 1 to 3 this normal matrix
display(sub)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [ ]:
sub = titanic_data.iloc[1:3, :]  #rows 1 to 2 this form python logic
display(sub)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

&nbsp;  
#### <font color="127C02">*Concatenating Dataframes*</span>

Oftentimes, you need to concatenate or join multiple Pandas dataframes horizontally or vertically. Let’s first see how to concatenate or join Pandas dataframes vertically. We will first create two Pandas dataframes using Titanic data. The first dataframe contains rows where the passenger class is 1, while the second dataframe contains rows where the passenger class is 2.

In [58]:
titanic_pclass1_data = titanic_data[titanic_data.Pclass == 1]
print(titanic_pclass1_data.shape)

titanic_pclass2_data = titanic_data[titanic_data.Pclass == 2]
print(titanic_pclass2_data.shape)

(216, 12)
(184, 12)

\
The output shows that both the newly created dataframes have 12 columns. It is important to mention that while concatenating data vertically, <u>both the dataframes should have an equal number of columns.</u>

In [ ]:
merged_data = pd.concat([titanic_pclass1_data, titanic_pclass2_data]).reset_index() #concat CON CAT need columns to same values , .reset_index(), must have,
print(merged_data.shape)
# display(merged_data.head())
# display(merged_data.tail())
merged_data

(400, 13)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
1,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
2,6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
3,11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
4,23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
395,866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
396,874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
397,880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
398,883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
399,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S

\
To concatenate dataframes horizontally, <u>make sure that the dataframes have an equal number of rows.</u> You can use the concat() method to concatenate dataframes horizontally as well. However, you will need to pass 1 as the value for the axis attribute.

In [82]:
df1 = merged_data[:200].filter(['Name', 'Sex', 'Age'])
display(df1.head())
print(df1.shape)

df2 = merged_data[:200].filter(['Pclass', 'Survived'])
display(df2.head())
print(df2.shape)

final_data2 = pd.concat([df1, df2], axis=1).reset_index()
display(final_data2.head(0))
print(final_data2.shape)

                                                Name     Sex   Age
0  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
2                            McCarthy, Mr. Timothy J    male  54.0
3                           Bonnell, Miss. Elizabeth  female  58.0
4                       Sloper, Mr. William Thompson    male  28.0

(200, 3)

   Pclass  Survived
0       1         1
1       1         1
2       1         0
3       1         1
4       1         1

(200, 2)

Empty DataFrame
Columns: [index, Name, Sex, Age, Pclass, Survived]
Index: []

(200, 6)

&nbsp;  
#### <font color="127C02">*Deleting Items*</span>

We can use drop() to remove a column / row at specific.
Bear in mind this is a new Series object unless we use the inplace keyword argument or explicitly using del.

In [61]:
df1.drop(
    'Age', axis=1
)  #axis = 1 for column. This create a copy of df1 that is not includes 'Age'
#df1.drop('Age', axis = 1, inplace = True) #this will delete column 'Age' from df1
#del df1['Age'] #this also delete column 'Age' from df1

                                                  Name     Sex
0    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
1         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
2                              McCarthy, Mr. Timothy J    male
3                             Bonnell, Miss. Elizabeth  female
4                         Sloper, Mr. William Thompson    male
..                                                 ...     ...
195                Carter, Master. William Thornton II    male
196                             Andrews, Mr. Thomas Jr    male
197     Chambers, Mrs. Norman Campbell (Bertha Griggs)  female
198                                   Fry, Mr. Richard    male
199  Hays, Mrs. Charles Melville (Clara Jennings Gr...  female

[200 rows x 2 columns]

In [62]:
df1.drop([1, 3], axis=0)

                                                  Name     Sex   Age
0    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                              McCarthy, Mr. Timothy J    male  54.0
4                         Sloper, Mr. William Thompson    male  28.0
5                       Fortune, Mr. Charles Alexander    male  19.0
6                             Uruchurtu, Don. Manuel E    male  40.0
..                                                 ...     ...   ...
195                Carter, Master. William Thornton II    male  11.0
196                             Andrews, Mr. Thomas Jr    male  39.0
197     Chambers, Mrs. Norman Campbell (Bertha Griggs)  female  33.0
198                                   Fry, Mr. Richard    male   NaN
199  Hays, Mrs. Charles Melville (Clara Jennings Gr...  female  52.0

[198 rows x 3 columns]

&nbsp;  
#### <font color="127C02">*Joining Dataframes*</span>

pandas provides various facilities for easily combining together dataframe with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

In addition, pandas also provides utilities to compare two dataFrame and summarize their differences.

\
Suppose we have two dataframes as in the following:

In [63]:
df1 = pd.DataFrame({
    'Name': ['John', 'Linda', 'Jack', 'Marry'],
    'Age': [23, 31, np.NaN, 15]
})
df1

    Name   Age
0   John  23.0
1  Linda  31.0
2   Jack   NaN
3  Marry  15.0

In [64]:
df2 = pd.DataFrame({
    'Name': ['Eric', 'Linda', 'Ken', 'Marry'],
    'Email': [
        'Eric@mail.com', 'Linda@mail.com', 'Ken@mail.com', 'Marry@mail.com'
    ]
})
df2

    Name           Email
0   Eric   Eric@mail.com
1  Linda  Linda@mail.com
2    Ken    Ken@mail.com
3  Marry  Marry@mail.com

\
***Inner Join***    
Inner join is the most common type of join you’ll be working with. It returns a dataframe with only those rows that have common characteristics.
An inner join requires each row in the two joined dataframes to have matching column values. This is similar to the intersection of two sets.

![Inner.png]()

In [65]:
pd.merge(df1, df2, how='inner', on='Name')

    Name   Age           Email
0  Linda  31.0  Linda@mail.com
1  Marry  15.0  Marry@mail.com

\
***Full Join***  
Full Join, also known as Full Outer Join, returns all those records which either have a match in the left or right dataframe.

![All.png]()

In [66]:
pd.merge(df1, df2, how='outer', on='Name')

    Name   Age           Email
0   John  23.0             NaN
1  Linda  31.0  Linda@mail.com
2   Jack   NaN             NaN
3  Marry  15.0  Marry@mail.com
4   Eric   NaN   Eric@mail.com
5    Ken   NaN    Ken@mail.com

\
All the non-matching rows of both the dataframes have NaN values for the columns of other dataframes. But we still don’t know which row belongs to which dataframe.  
For this, Pandas provides us with a fantastic solution. We just have to mention the indicator argument as True in the function, and a new column of name _merge will be created in the resulting dataframe:

In [67]:
pd.merge(df1, df2, how='outer', on='Name', indicator=True)

    Name   Age           Email      _merge
0   John  23.0             NaN   left_only
1  Linda  31.0  Linda@mail.com        both
2   Jack   NaN             NaN   left_only
3  Marry  15.0  Marry@mail.com        both
4   Eric   NaN   Eric@mail.com  right_only
5    Ken   NaN    Ken@mail.com  right_only

\
***Left Join***  
Left join, also known as Left Outer Join, returns a dataframe containing all the rows of the left dataframe.

![Left.png]()

In [68]:
pd.merge(df1, df2, how='left', on='Name')

    Name   Age           Email
0   John  23.0             NaN
1  Linda  31.0  Linda@mail.com
2   Jack   NaN             NaN
3  Marry  15.0  Marry@mail.com

\
***Right Join***  
Right join, also known as Right Outer Join, is similar to the Left Outer Join. The only difference is that all the rows of the right dataframe are taken as it is and only those of the left dataframe that are common in both.

![Right.png]()

In [69]:
pd.merge(df1, df2, how='right', on='Name')

    Name   Age           Email
0   Eric   NaN   Eric@mail.com
1  Linda  31.0  Linda@mail.com
2    Ken   NaN    Ken@mail.com
3  Marry  15.0  Marry@mail.com

In [70]:
index = [n not in list(df2.Name) for n in list(df1.Name)]
df1[index]

   Name   Age
0  John  23.0
2  Jack   NaN

&nbsp;  
#### <font color="127C02">*Handling Redundancy / Duplicates in Joins*</span>

Duplicate values can be tricky obstacles. They can cause problems while performing joins. These values won’t give an error but will simply create redundancy in our resulting dataframe.  
  
\
Suppose we have two dataframes:

In [71]:
df1 = pd.DataFrame({
    'Name': ['John', 'Linda', 'Jack', 'Marry', 'John'],
    'Age': [23, 31, np.NaN, 15, 23]
})
df1  #John is duplicated

    Name   Age
0   John  23.0
1  Linda  31.0
2   Jack   NaN
3  Marry  15.0
4   John  23.0

In [72]:
df2 = pd.DataFrame({
    'Name': ['Eric', 'Linda', 'Ken', 'Marry', 'Ken'],
    'Email': [
        'Eric@mail.com', 'Linda@mail.com', 'Ken@mail.com', 'Marry@mail.com',
        'Ken@mail.com'
    ]
})
df2  #Ken is duplicated

    Name           Email
0   Eric   Eric@mail.com
1  Linda  Linda@mail.com
2    Ken    Ken@mail.com
3  Marry  Marry@mail.com
4    Ken    Ken@mail.com

In [73]:
pd.merge(df1, df2, how='outer', on='Name', indicator=True)

    Name   Age           Email      _merge
0   John  23.0             NaN   left_only
1   John  23.0             NaN   left_only
2  Linda  31.0  Linda@mail.com        both
3   Jack   NaN             NaN   left_only
4  Marry  15.0  Marry@mail.com        both
5   Eric   NaN   Eric@mail.com  right_only
6    Ken   NaN    Ken@mail.com  right_only
7    Ken   NaN    Ken@mail.com  right_only

\
We can use drop_duplicates() to remove duplicated rows in joined dataframe.

In [74]:
pd.merge(df1, df2, how='outer', on='Name', indicator=True).drop_duplicates()

    Name   Age           Email      _merge
0   John  23.0             NaN   left_only
2  Linda  31.0  Linda@mail.com        both
3   Jack   NaN             NaN   left_only
4  Marry  15.0  Marry@mail.com        both
5   Eric   NaN   Eric@mail.com  right_only
6    Ken   NaN    Ken@mail.com  right_only

\
We can also remove duplicate rows before joining using .drop_duplicates().

In [75]:
pd.merge(df1.drop_duplicates(),
         df2.drop_duplicates(),
         how='outer',
         on='Name',
         indicator=True)

    Name   Age           Email      _merge
0   John  23.0             NaN   left_only
1  Linda  31.0  Linda@mail.com        both
2   Jack   NaN             NaN   left_only
3  Marry  15.0  Marry@mail.com        both
4   Eric   NaN   Eric@mail.com  right_only
5    Ken   NaN    Ken@mail.com  right_only

&nbsp;  
#### <font color="127C02">*Split a String Column*</span>

A common problem is how to split a string column into components.
For example, split name and surname.

In [76]:
df = pd.DataFrame(dict(name=['John Smith', 'Kim Saika', 'Rose Miller']))
df

          name
0   John Smith
1    Kim Saika
2  Rose Miller

\
The key step is the expand keyword argument of split() that converts the result into a dataframe.  
The result can be assigned into the same dataframe using the following:

In [77]:
df[['first', 'last']] = df.name.str.split(' ', expand=True)
df

          name first    last
0   John Smith  John   Smith
1    Kim Saika   Kim   Saika
2  Rose Miller  Rose  Miller

\
Note that failing to use the expand keyword argument results in an output series instead of a dataframe.

In [78]:
x = df.name.str.split(' ')
print(x)
type(x)

0     [John, Smith]
1      [Kim, Saika]
2    [Rose, Miller]
Name: name, dtype: object

pandas.core.series.Series